OdDAI.Iterator.type
\details
Retrieves aggregate instance items value type.

OdDAI.Iterator.testCurrentMember
\details
Determines whether a value is set for the particular position in array instance.

OdDAI.Iterator.removeCurrentMember
\details
Removes the current aggregate member referenced by an iterator.

OdDAI.Iterator.addAfterCurrentMember(OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Adds a member to a list instance referenced by an iterator. New member added immediately after current member,
the current member position is unchanged.
\remarks
Throws an exception with AI_NVLD code if aggregate instance is not a list.

OdDAI.Iterator.addBeforeCurrentMember(OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Adds a member to a list instance referenced by an iterator. New member added immediately before current member,
the current member position is unchanged.
\remarks
Throws an exception with AI_NVLD code if aggregate instance is not a list.

OdDAI.Iterator.putCurrentMember(OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Replaces the value of a current member of an aggregate instance with the specified value.

OdDAI.Iterator.getCurrentMemberValue
\details
Retrieves the value of the current member of aggregate instance referenced by an iterator.

OdDAI.Iterator.getCurrentMember
\details
Retrieves the value of the current member of aggregate instance referenced by an iterator.

OdDAI.Iterator.end
\details
Positions an iterator on an ordered collection so that there is no current member and
so that a Previous operation will cause the last member in the ordered collection to
become the current member.

OdDAI.Iterator.previous
\details
Sets preceding member of an ordered collection as the new current member.

OdDAI.Iterator.next
\details
Positions iterator so that it has a new current member.

OdDAI.Iterator.beginning
\details
Positions iterator at the beginning of aggregate instance, so there is no current member.

OdDAI.Iterator
\details
Abstract class for access to typed iterator along aggregate.